/**
 * Swing用户界面组件：首先介绍Swing体系结构，常用组件，如何布局组件，最后介绍对话框。
 * 
 * Swing与模型-视图-控制器设计模式
 * 	设计模式
 * 	模型-视图-控制器模式
 * 	Swing按钮的模型-视图-控制器分析
 * 布局管理概述：决定容器中组件的放置位置和大小。
 * 	边框布局：是JFrame的默认布局管理器。
 * 	网格布局
 * 文本输入
 * 	文本域
 * 	标签和标签组件
 * 	密码域
 * 	文本区
 * 	滚动窗格
 * 选择组件
 * 	复选框
 * 	单选按钮
 * 	边框
 * 	组合框
 * 	滑动条
 * 菜单
 * 	菜单创建
 * 	菜单项中的图标
 * 	复选框和单选按钮菜单项
 * 	弹出菜单
 * 	快捷键和加速器
 * 	工具栏
 * 	工具提示
 * 复杂的布局管理
 * 	网格组布局
 * 	组布局
 * 	不使用布局管理器
 * 	定制布局管理器
 * 	遍历顺序
 * 对话框
 * 	选项对话框
 * 	创建对话框
 * 	数据交换
 *	文件对话框
 *	颜色选择器
 * @author niu
 */
package v1.ch09;